@extends('layouts.app')
@section('content')
    <div>
        <a href="#">HOME</a>
        &nbsp;&Gt;&nbsp;
        <strong>基本情報技術者とは</strong>
    </div>
    <section class="side-section">
        <h5>基本情報技術者試験で私がおすすめする参考書・問題集</h5>
        <p>※最終更新日2024年3月16日</p>
        <br><br>
        <p>基本情報技術者試験の参考書は、年1回の公開問題の傾向やシラバスの改定を踏まえて年1回の改訂が行われています（毎年11月～12月が新年度版の発売時期です）。</p>
        <br><br>
        <p>現在発売されている主な基本情報技術者試験対策テキストとしては、</p>
        <ul>
            <li>令和06年 イメージ＆クレバー方式 栢木先生の基本情報技術者試験教室</li>
            <li>キタミ式イラストIT塾「基本情報技術者」 令和06年</li>
            <li>【令和6年度】 いちばんやさしい 基本情報技術者試験 絶対合格の教科書＋出る順問題集</li>
            <li>ニュースペックテキスト 基本情報技術者 2024年度</li>
        </ul>
        <p>などがありますが、私がおすすめするのは、やはり<strong>イメージ＆クレバー方式でよくわかる栢木（かやのき）先生の基本情報技術者試験教室</strong>です。
        </p>
        <br><br>
        <p>「<strong>栢木先生の基本情報技術者試験教室シリーズ</strong>」は「イメージ＆クレバー式」というようにネコをキャラクターにしたり、挿絵を多く使うなど「文とイメージを同時に頭に入れることで初めて学ぶ知識がわかりやすい」と、この試験では定番のシリーズです。
            私も初級シスアド試験・基本情報技術者試験とお世話になりました。
        </p>
        <br><br>
        <p>私はITパスポート試験においてもこの参考書をすすめておりますが、実はこの本は、<strong>基本情報技術者試験のほうがより高い実績をあげています</strong>。
            はじめて触れる人にはとっつきにくいデータベースのSQL文や情報基礎などのテクノロジ分野の深い武運を、理解が早まるように筆者が考え出したのが、絵と例えをつかって脳にイメージとして記憶されやすくするという「イメージ＆クレバー式」なのです。
            試験範囲で重要な項目を丁寧に解説してありますので、文章だらけの教科書が苦手な方にはもってこいです。
            文章が少なく行間も広めでさらに、コミカルな猫の挿絵のおかげで教科書という感じが少なく非常に読みやすい書面構成となっています。
        </p>
        <br><br>
        <p>このシリーズの中で私が一番に気に入っているのは、各単語ごとにまとめられている「○○とくれば■■」という要点のまとめです。
            どれも一行、多くても二行で書かれていて非常にわかりやすく、テキストを読み込むときも要点だけをすばやく復習することができました。
            資格試験のテキストというと、「試験範囲をくまなく解説」を売りにしている本が多い中、出題回数の少ない分野をばっさり切り捨てて、重要な分野を中心として合格点を取ることを第一目的に考えられたこの本のコンセプトはなかなかすごいと思います。
        </p>
        <br><br>
        <p>その反面、過去問の中にはこの参考書では解説されていない論点が出題されていることも普通にあります。
            これは「出題回数が多くない論点は合格点獲得だけを目指すためには必要ない」と参考書から省かれているのです。
            したがって、試験範囲を完全に網羅するには必然的に下記説明する過去問題集・予想問題集での演習が必要となってきます。
        </p>
        <br><b>
            <p>他の本についても紹介しておきます</p>
            <br><br>
            <p><strong>キタミ式イラストIT塾<strong>は、上記の栢木本の記載内容でも難しく感じてしまう受験者に向いているかと思います。
                        表紙に「わかりやすさに自信あり」と掲げており、詳細な技術要素よりも、まず参考書を一通り読んで用語や計算に慣れることを重視した構成になっています。
                        その点が評価さえてか、プログラムやSEを目指しているわけではない文系学生や事務職の人などからの人気が上昇しています。
                        ただしこの本だけでは、「本試験（特に科目B試験）には対応できない」とのレビューも寄せられていますので、必要に応じて他の参考書も購入する気持ちでいたほうがいいでしょう。
                        <br>
                        この参考書のページ数は基本情報技術者試験対策の参考書の中でも随一の多さのため、手に取った時には気が重くなるかもしれませんが、このページ数の多さがイラストや漫画が多用されているからでしょう。
                        文章量は他の参考書と比べて特別多いわけではありません。
                        非常に親しみやすい内容になっていますので、可能であれば一度中身を見てみることをおすすめします。
            </p>
            <br><br>
            <p><strong>いちばんやさしい 基本情報技術者試験</strong>は、ITパスポート試験で圧倒的な人気を誇る高橋 京介先生の「いちばんやさしい ITパスポート」の基本情報技術者試験版です。
                ITパスポート試験でお世話になったという方も多いのではないでしょうか。令和4年4月に刊行されたばかりの新星であり、実力派未知数ですがITパスポートの方では圧倒的な人気を誇りますから、技術評論社一強の基本情報技術者テキスト業界に風穴を開ける存在となるかもしれません。
                紙面の感じが気に入っている人は選択の一つとなるのでしょう。
            </p>
            <br><br>
            <p><strong>ニュースペックテキスト 基本情報技術者</strong>は、資格の学校「TAC」が出版しているテキストです。
                TACは、試験の度に解答速報を公開するなど、情報処理技術者試験受験者の中では著名な存在です。
                従来は通信講座が主な商品だったのですが、昨今はテキストの出版にも力を入れてきているようです。
                企業として長い間情報処理技術者試験に携わることで得た知見と、通信講座で培ったノウハウが1冊の参考書に詰め込まれています。
                売れ筋の参考書の中で唯一オールカラーなこともおすすめポイントの一つです。
            </p>
            <h5>科目B試験への対策本</h5>
            <p>基本情報技術者の科目B試験で出題される全20問中、疑似言語を用いたアルゴリズムやプログラミングに関する問題が全体の16問程度、残りの4問程度がセキュリティの問題で構成されています。
                プログラミングに関する問題が全体の8割を占めるので、科目B対策=プログラミング問題対策となってきます。
            </p>
            <br><br>
            <p>プログラム問題は、プログラムのソースコード、処理内容や変数の説明などが与えられた上で、正しい結果を得るための文を空欄に当てはめたり、処理の結果出力される値を答えたりする問題です。
                疑似言語も従来の記号でプログラム構造を表記するものから for や if など通常のプログラミングで使われる気泡に代わるなど多少読みやすくはなりましたが、プログラミングをしたことのない方にとってはなじみがないことには変わりません。
                現役のプログラマの方やプログラミングや趣味の方は特段の対策は不要かと思いますが、未経験の方は科目B対策本を一冊購入して、問題形式やプログラミング問題を解く上での思考プロセスに慣れておくことが必要となるでしょう。
            </p>
            <br><br>
            <p>科目B試験に特化した対策本として発売されているのが以下の4冊です。</p>
            <br><br>
            <ul>
                <li>情報処理教科書 出るとこだけ!基本情報技術者[科目B]
            </ul>
    </section>
@endsection()
